evaluationRequestSeverityLevel(AcDbAssocStatus)
Returns the severity level (positive integer) of those status values that
indicate a request for an AcDbAssocAction or an AcDbAssocDependency to be
evaluated, or 0 if the status does not indicate an evaluation request.
Higher numbers mean more "severe" requests to evaluate.
status:  The AcDbAssocStatus.
Returns:
Evaluation request severity level (positive integer) if or 0 if not a
request to evaluate.